package com.lemon.java.day01;
/*
一，面向对象内容得三条主线
1.java类及类得成员:属性，方法，构造器；代码块，内部类

2.面向对象得三大特征：封装性，继承性，多态性，（抽象性）

3.其他关键字：this,super,static,final,abstract,interface,package,import等

大处着眼，小处着手

二，人把大象装进冰箱

1.面向过程，强调得是功能行为，以函数为最小单位，考虑怎么做。
①，把冰箱门打开
②，抬起大象，塞进冰箱
③，把冰箱门关闭

2.面向对象：强调具备了功能得对象，以类/对象为最小单位，考虑谁来做。

人{
    打开(冰箱){
            冰箱.开开();
        }
     抬起(大象){
        大象.进入(冰箱);
     }
     关闭(冰箱){
        冰箱.闭合();
     }
}

冰箱{
    开开(){}
    闭合(){}
}
大象{
    进入(冰箱){

    }
}
 */
public class OOPTest {
    public static void main(String[] args) {
        
    }
}
